import HomeLanding from "../components/HomeLanding";
import ServiceContainer from "../components/ServiceContainer";
import ServiceHeader from "../components/ServiceHeader";
import imgTest from "../asists/واجهة القرية/img36.png";
export default function Villages() {
  const arr = [
    {
      title: "المستفشيات",
      info: [
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
      ],
    },
    {
      title: "المدارس",
      info: [
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
      ],
    },
    {
      title: "المولات و المحلات",
      info: [
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
        {
          badge: "صحة",
          img: imgTest,
          info: "توفر مستشفي رأس الخليج البلد الخدمات المتكامله داخلها من فحوصات وخدمات طبيه واللي اخيره ويتوفر بها العملياات الطبيه والرعايه الصحية",
        },
      ],
    },
  ];
  return (
    <>
      <HomeLanding />
      <ServiceHeader title="خدمات القري" />
      {arr.map((service) => {
        return <ServiceContainer info={service.info} title={service.title} />;
      })}
    </>
  );
}
